In [1]:
import sqlite3 as db

In [2]:
# connect to the database
conn = db.connect('example.db')
conn

In [3]:
cursor = conn.cursor()

In [4]:
# Create a table
cursor.execute('''CREATE TABLE IF NOT EXISTS students 
                    (id INTEGER PRIMARY KEY, 
                    name TEXT NOT NULL, 
                    age INTEGER,
                    branch TEXT
               )
               ''')
conn.commit()

In [5]:
#insert data into the table
cursor.execute('''INSERT INTO students (id, name, age, branch)
                    VALUES (335, 'John Doe', 21, 'Electrical Engineering')        
                    ''')

cursor.execute('''INSERT INTO students (id, name, age, branch)
                    VALUES (336, 'Alice', 22, 'Computer Science')        
                    ''')

cursor.execute('''INSERT INTO students (id, name, age, branch)
                    VALUES (337, 'Bob', 23, 'Mechanical Engineering')        
                    ''')
conn.commit()

In [7]:
# Fetch and display data
cursor.execute('SELECT * FROM students')    
rows = cursor.fetchall()

for row in rows:
    print(row)

(335, 'John Doe', 21, 'Electrical Engineering')
(336, 'Alice', 22, 'Computer Science')
(337, 'Bob', 23, 'Mechanical Engineering')

In [8]:
# update data in the table
cursor.execute('''UPDATE students
                    SET age = 34
                    WHERE id = 336
                ''')
conn.commit()

In [10]:
# Fetch and display data
cursor.execute('SELECT * FROM students')    
rows = cursor.fetchall()

for row in rows:
    print(row)

(335, 'John Doe', 21, 'Electrical Engineering')
(336, 'Alice', 34, 'Computer Science')
(337, 'Bob', 23, 'Mechanical Engineering')

In [11]:
# delete data from the table
cursor.execute('''DELETE FROM students
                    WHERE id = 335
                ''')
conn.commit()

In [12]:
# Fetch and display data
cursor.execute('SELECT * FROM students')    
rows = cursor.fetchall()

for row in rows:
    print(row)

(336, 'Alice', 34, 'Computer Science')
(337, 'Bob', 23, 'Mechanical Engineering')